app/Controllers/Admin.php

SELECT *
FROM `admins`
WHERE `email` = 'admin@springflowers.com'
 LIMIT 1
---
    public function authenticate()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        if (empty($email) || empty($password)) {
            return redirect()->back()->with('error', 'Please enter both email and password.');
        }

        // Debug: Check if admin exists
        $adminExists = $this->adminModel->where('email', $email)->first();

SELECT *
FROM `contact`
ORDER BY `id` DESC
SELECT *
FROM `keeper_forms`
ORDER BY `id` DESC
SELECT *
FROM `contact`
SELECT *
FROM `registrations`
ORDER BY `id` DESC
SELECT *
FROM `registrations`
SELECT *
FROM `keeper_forms`
SELECT *
FROM `subscriptions`
ORDER BY `id` DESC
---
   public function LeadManagerView(){
    if (!$this->isLoggedIn()) {
        return redirect()->to('/admin/login');
    }

    $db = \Config\Database::connect();

    $contactData = $db->table('contact')->get()->getResultArray();
    $keeperData = $db->table('keeper_forms')->get()->getResultArray();
    $registrationData = $db->table('registrations')->get()->getResultArray();
    $subscriptionData = $db->table('subscriptions')->get()->getResultArray();