app/Controllers/Functions.php

    public function ContactFunction(){
        // Log the request for debugging
        log_message('info', 'ContactFunction called');
        log_message('info', 'Request method: ' . $this->request->getMethod());
        log_message('info', 'Is AJAX: ' . ($this->request->isAJAX() ? 'yes' : 'no'));

        $Contact = new ContactModel();

        $data = [
            'name'=>$this->request->getVar('name'),
            'email'=>$this->request->getVar('email'),
            'phone'=>$this->request->getVar('phone'),
            'service'=>$this->request->getVar('service'),
            'message'=>$this->request->getVar('message'),
        ];

        // Log the data being saved
        log_message('info', 'Contact data: ' . json_encode($data));

        $save_contact = $Contact->save($data);
---
INSERT INTO `contact` (`name`, `email`, `phone`, `service`, `message`) VALUES ('test', '20akshaychauhan@gmail.com', '9876543221', 'House Keeping', 'test')

	public function PropertyDateSubmit(){
		// Get property details from session
		$propertyDetails = session()->get('property_details');

		// Check if property details exist in session
		if (!$propertyDetails) {
			if ($this->request->isAJAX()) {
				return $this->response->setStatusCode(400)->setJSON(['success' => false, 'message' => 'Property details not found. Please start from the beginning.']);
			}
			return redirect()->to('/property-form')->with('error', 'Property details not found. Please start from the beginning.');
		}

		// Get date form data
		$plan = $this->request->getVar('plan');
		$selectedDate = $this->request->getVar('selected_date');
		$selectedDays = $this->request->getVar('selected_days');
		$timing = $this->request->getVar('timing');

		// Combine all data
		$data = array_merge($propertyDetails, [
			'plan' => $plan,
			'selected_date' => $selectedDate,
			'selected_days' => $selectedDays,
			'timing' => $timing,
		]);

		// Save to database only once at the end
		$keeper = new KeeperFormModel();
		$save = $keeper->save($data);
---
INSERT INTO `keeper_forms` (`num_rooms`, `num_kitchens`, `num_bathrooms`, `name`, `phone`, `town_area`, `city`, `postal_code`, `address`, `plan`, `selected_date`, `selected_days`, `timing`, `created_at`, `updated_at`) VALUES ('1', '1', '1', 'Vikram Bhanwala', '08685011980', 'Bath', 'sec 37 D gurugram', '122006', 'Hno D602 The Atrium', 'Weekly', '2025-10-15', 'monday,Thursday', 'Morning', '2025-10-08 17:06:42', '2025-10-08 17:06:42')

		// Log the data being saved
		log_message('info', 'Registration data: ' . json_encode($data));

		$save = $registration->save($data);
---
INSERT INTO `registrations` (`job_type`, `name`, `phone`, `email`, `country_of_living`, `county`, `type_of_work`, `availability_type`, `start_date`, `message`, `cv_filename`, `cv_path`, `status`, `created_at`, `updated_at`) VALUES ('Cook', 'Vikram Bhanwala', '08685011980', 'vikrambhanwala1@gmail.com', 'India', 'Haryana', 'live_out_work', 'full_time_availability', 'flexible_start', 'Zx', '1759075657_homepage.pdf', 'uploads/cv/1759075657_homepage.pdf', 'pending', '2025-09-28 16:07:37', '2025-09-28 16:07:37')