app/Models/AdminModel.php

    public function verifyPassword($email, $password)
    {
        $admin = $this->where('email', $email)->first();
---
SELECT *
FROM `admins`
WHERE `email` = 'admin@springflowers.com'
 LIMIT 1